Revit 2027 API
BuiltInFailures.CutFailures.CannotCutInstanceOutGenError Property
 Can't cut instance(s) of [Symbol] out of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutInstanceOutGenError { get; }
Public Shared ReadOnly Property CannotCutInstanceOutGenError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutInstanceOutGenError {
	FailureDefinitionId^ get ();
}
static member CannotCutInstanceOutGenError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace